title: Powershell Using Expand-Archive Module From User
id: 1dba52c5-f073-41d4-872a-a9bf81e945d0
status: experimental
description: Expand-Archive is a Powershell module that can be used to unpack archives. 
references:
    - https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.archive/expand-archive?view=powershell-7.4
tags:
    - attack.execution
    - attack.t1059
author: Jacob Smitherman
date: 2024-10-1
logsource:                      
    category: process_creation
    product: windows
detection:
    selection:
        - Image|endswith: '\powershell.exe'
        - Image|endswith: '\pwsh.exe'
    selection2:
        CommandLine|contains:
        - 'Expand-Archive'
    selection3:
        CommandLine|contains:
        - '-LiteralPath'
        - '-Path'
    filter:
        User|contains:
            - 'AUTHORI'
            - 'AUTORI'
    condition: selection and filter
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Adminstrative Activity
    - Software Installation
level: low